app/views/cliente/home.html.erb

SELECT [Cliente].* FROM [Cliente] WHERE [Cliente].[Id] = 1 ORDER BY [Cliente].[Id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
---
      <link href="https://fonts.googleapis.com/css2?family=Roboto:wght@400;700&display=swap" rel="stylesheet">
      <h1>Bienvenido <%= Cliente.find(session[:cliente_id]).Nombre if session[:cliente_id] %></h1>