app/controllers/admin_controller.rb

SELECT [Producto].* FROM [Producto] WHERE [Producto].[Id] = 1 ORDER BY [Producto].[Id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
UPDATE [Producto] SET [Stock] = 51 WHERE [Producto].[Id] = 1; SELECT @@ROWCOUNT AS AffectedRows
---
  def comprar_stock
    producto = Producto.find(params[:id])
    cantidad = params[:cantidad].to_i
    producto.Stock += cantidad
    producto.save

INSERT INTO [Producto] ([Nombre], [Precio], [Stock]) OUTPUT INSERTED.[Id] VALUES (N'Teclado', 15000.0, 5)
---
  def crear_producto
    Producto.create(
      Nombre: params[:nombre],
      Precio: params[:precio],
      Stock: params[:stock]
    )