app/controllers/cliente_controller.rb

SELECT [Producto].* FROM [Producto] WHERE [Producto].[Id] = 4 ORDER BY [Producto].[Id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
SELECT [Producto].* FROM [Producto] WHERE [Producto].[Id] = 1 ORDER BY [Producto].[Id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
---
  def comprar_producto
    producto = Producto.find(params[:id])
    cantidad = params[:cantidad].to_i

    session[:carrito] ||= []
    existente = session[:carrito].find { |item| (item["id"] || item[:id]) == producto.Id }